---
kind: method
id: M:Autodesk.Revit.DB.Structure.ConnectionInputPoint.#ctor(Autodesk.Revit.DB.XYZ)
source: html/aa8754e3-af8b-60ab-41b5-07f1270efb6a.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPoint.#ctor Method

Construct an input point from 3d point. A new valid id will be auto-generated.

## Syntax (C#)
```csharp
public ConnectionInputPoint(
	XYZ pt
)
```

## Parameters
- **pt** (`Autodesk.Revit.DB.XYZ`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null